geraldjust/MegaCore/avr/boards.txt
1281.menu.LTO.Os_flto=LTO enabled
1281.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
1281.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
1281.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
1281.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
1281.menu.clock.16MHz_external=16 MHz external
1281.menu.clock.16MHz_external.upload.speed=115200
1281.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.16MHz_external.build.f_cpu=16000000L

1281.menu.clock.20MHz_external=20 MHz external
1281.menu.clock.20MHz_external.upload.speed=115200
1281.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.20MHz_external.build.f_cpu=20000000L

1281.menu.clock.18_432MHz_external=18.432 MHz external
1281.menu.clock.18_432MHz_external.upload.speed=115200
1281.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.18_432MHz_external.build.f_cpu=18432000L

1281.menu.clock.12MHz_external=12 MHz external
1281.menu.clock.12MHz_external.upload.speed=57600
1281.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.12MHz_external.build.f_cpu=12000000L

1281.menu.clock.8MHz_external=8 MHz external
1281.menu.clock.8MHz_external.upload.speed=38400
1281.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.8MHz_external.build.f_cpu=8000000L

1281.menu.clock.8MHz_internal=8 MHz internal
1281.menu.clock.8MHz_internal.upload.speed=38400
1281.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
1281.menu.clock.8MHz_internal.build.f_cpu=8000000L

1281.menu.clock.1MHz_internal=1 MHz internal
1281.menu.clock.1MHz_internal.upload.speed=9600
1281.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1281.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega1280  ####
#####################

# General
1280.name=ATmega1280
1280.upload.tool=avrdude
1280.upload.maximum_data_size=8192
1280.bootloader.tool=avrdude
1280.bootloader.unlock_bits=0x3f
1280.bootloader.lock_bits=0x0f
1280.build.core=MCUdude_corefiles
1280.build.board=AVR_ATmega1280
1280.build.mcu=atmega1280

# Upload port select
1280.menu.bootloader.uart0=Yes (UART0)
1280.menu.bootloader.uart0.upload.maximum_size=130048
1280.menu.bootloader.uart0.upload.protocol=arduino
1280.menu.bootloader.uart0.upload.port=UART0
1280.menu.bootloader.uart0.bootloader.high_fuses=0xd6
1280.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_eeprom_support.hex

1280.menu.bootloader.uart1=Yes (UART1)
1280.menu.bootloader.uart1.upload.maximum_size=130048
1280.menu.bootloader.uart1.upload.protocol=arduino
1280.menu.bootloader.uart1.upload.port=UART1
1280.menu.bootloader.uart1.bootloader.high_fuses=0xd6
1280.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_eeprom_support.hex

1280.menu.bootloader.uart2=Yes (UART2)
1280.menu.bootloader.uart2.upload.maximum_size=130048
1280.menu.bootloader.uart2.upload.protocol=arduino
1280.menu.bootloader.uart2.upload.port=UART2
1280.menu.bootloader.uart2.bootloader.high_fuses=0xd6
1280.menu.bootloader.uart2.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_eeprom_support.hex

1280.menu.bootloader.uart3=Yes (UART3)
1280.menu.bootloader.uart3.upload.maximum_size=130048
1280.menu.bootloader.uart3.upload.protocol=arduino
1280.menu.bootloader.uart3.upload.port=UART3
1280.menu.bootloader.uart3.bootloader.high_fuses=0xd6
1280.menu.bootloader.uart3.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_eeprom_support.hex

1280.menu.bootloader.no_bootloader=No bootloader
1280.menu.bootloader.no_bootloader.upload.maximum_size=131072
1280.menu.bootloader.no_bootloader.bootloader.high_fuses=0xd7
1280.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Pinouts
1280.menu.pinout.mega_pinout=Arduino MEGA pinout
1280.menu.pinout.mega_pinout.build.variant=100-pin-arduino-mega
1280.menu.pinout.avr_pinout=AVR pinout
1280.menu.pinout.avr_pinout.build.variant=100-pin-avr

# Brown out detection
1280.menu.BOD.2v7=BOD 2.7V
1280.menu.BOD.2v7.bootloader.extended_fuses=0xfd
1280.menu.BOD.4v3=BOD 4.3V
1280.menu.BOD.4v3.bootloader.extended_fuses=0xfc
1280.menu.BOD.1v8=BOD 1.8V
1280.menu.BOD.1v8.bootloader.extended_fuses=0xfe
1280.menu.BOD.disabled=BOD disabled
1280.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
1280.menu.LTO.Os=LTO disabled
1280.menu.LTO.Os.compiler.c.extra_flags=
1280.menu.LTO.Os.compiler.c.elf.extra_flags=
1280.menu.LTO.Os.compiler.cpp.extra_flags=
1280.menu.LTO.Os.ltoarcmd=avr-ar

1280.menu.LTO.Os_flto=LTO enabled
1280.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
1280.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
1280.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
1280.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
1280.menu.clock.16MHz_external=16 MHz external
1280.menu.clock.16MHz_external.upload.speed=115200
1280.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.16MHz_external.build.f_cpu=16000000L

1280.menu.clock.20MHz_external=20 MHz external
1280.menu.clock.20MHz_external.upload.speed=115200
1280.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.20MHz_external.build.f_cpu=20000000L

1280.menu.clock.18_432MHz_external=18.432 MHz external
1280.menu.clock.18_432MHz_external.upload.speed=115200
1280.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.18_432MHz_external.build.f_cpu=18432000L

1280.menu.clock.12MHz_external=12 MHz external
1280.menu.clock.12MHz_external.upload.speed=57600
1280.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.12MHz_external.build.f_cpu=12000000L

1280.menu.clock.8MHz_external=8 MHz external
1280.menu.clock.8MHz_external.upload.speed=38400
1280.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.8MHz_external.build.f_cpu=8000000L

1280.menu.clock.8MHz_internal=8 MHz internal
1280.menu.clock.8MHz_internal.upload.speed=38400
1280.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.8MHz_internal.build.f_cpu=8000000L

1280.menu.clock.1MHz_internal=1 MHz internal
1280.menu.clock.1MHz_internal.upload.speed=9600
1280.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1280.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega640  ####
#####################

# General
640.name=ATmega640
640.upload.tool=avrdude
640.upload.maximum_data_size=8192
640.bootloader.tool=avrdude
640.bootloader.unlock_bits=0x3f
640.bootloader.lock_bits=0x0f
640.build.core=MCUdude_corefiles
640.build.board=AVR_ATmega640
640.build.mcu=atmega640

# Upload port select
640.menu.bootloader.uart0=Yes (UART0)
640.menu.bootloader.uart0.upload.maximum_size=64512
640.menu.bootloader.uart0.upload.protocol=arduino
640.menu.bootloader.uart0.upload.port=UART0
640.menu.bootloader.uart0.bootloader.high_fuses=0xd6
640.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_eeprom_support.hex

640.menu.bootloader.uart1=Yes (UART1)
640.menu.bootloader.uart1.upload.maximum_size=64512
640.menu.bootloader.uart1.upload.protocol=arduino
640.menu.bootloader.uart1.upload.port=UART1
640.menu.bootloader.uart1.bootloader.high_fuses=0xd6
640.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_eeprom_support.hex

640.menu.bootloader.uart2=Yes (UART2)
640.menu.bootloader.uart2.upload.maximum_size=64512
640.menu.bootloader.uart2.upload.protocol=arduino
640.menu.bootloader.uart2.upload.port=UART2
640.menu.bootloader.uart2.bootloader.high_fuses=0xd6
640.menu.bootloader.uart2.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_eeprom_support.hex

640.menu.bootloader.uart3=Yes (UART3)
640.menu.bootloader.uart3.upload.maximum_size=64512
640.menu.bootloader.uart3.upload.protocol=arduino
640.menu.bootloader.uart3.upload.port=UART3
640.menu.bootloader.uart3.bootloader.high_fuses=0xd6
640.menu.bootloader.uart3.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_eeprom_support.hex

640.menu.bootloader.no_bootloader=No bootloader
640.menu.bootloader.no_bootloader.upload.maximum_size=65536
640.menu.bootloader.no_bootloader.bootloader.high_fuses=0xd7
640.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Pinouts
640.menu.pinout.mega_pinout=Arduino MEGA pinout
640.menu.pinout.mega_pinout.build.variant=100-pin-arduino-mega
640.menu.pinout.avr_pinout=AVR pinout
640.menu.pinout.avr_pinout.build.variant=100-pin-avr

# Brown out detection
640.menu.BOD.2v7=BOD 2.7V
640.menu.BOD.2v7.bootloader.extended_fuses=0xfd
640.menu.BOD.4v3=BOD 4.3V
640.menu.BOD.4v3.bootloader.extended_fuses=0xfc
640.menu.BOD.1v8=BOD 1.8V
640.menu.BOD.1v8.bootloader.extended_fuses=0xfe
640.menu.BOD.disabled=BOD disabled
640.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
640.menu.LTO.Os=LTO disabled
640.menu.LTO.Os.compiler.c.extra_flags=
640.menu.LTO.Os.compiler.c.elf.extra_flags=
640.menu.LTO.Os.compiler.cpp.extra_flags=
640.menu.LTO.Os.ltoarcmd=avr-ar

640.menu.LTO.Os_flto=LTO enabled
640.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
640.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
640.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
640.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

